; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	spectrograph2 - mode
	spectrograph0 - mode
	thermograph1 - mode
	infrared3 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	Star3 - direction
	Star4 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Star7 - direction
	Star8 - direction
	Planet9 - direction
	Star10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 infrared3)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 Star3)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation2)
	(supports instrument3 infrared3)
	(supports instrument3 spectrograph0)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 Star3)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet6)
	(supports instrument4 spectrograph2)
	(supports instrument4 infrared3)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 spectrograph0)
	(supports instrument5 infrared3)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 Star3)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star7)
	(supports instrument6 spectrograph2)
	(supports instrument6 infrared3)
	(calibration_target instrument6 Star4)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star3)
)
(:goal (and
	(pointing satellite2 Phenomenon12)
	(have_image Phenomenon5 spectrograph2)
	(have_image Planet6 spectrograph0)
	(have_image Star7 infrared3)
	(have_image Star8 infrared3)
	(have_image Planet9 thermograph1)
	(have_image Star10 spectrograph2)
	(have_image Star11 spectrograph2)
	(have_image Phenomenon12 spectrograph2)
	(have_image Star13 infrared3)
	(have_image Phenomenon14 spectrograph0)
	(have_image Phenomenon15 spectrograph2)
))

)

; plan
1. (turn_to satellite2 groundstation2 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 groundstation2)
   goals met: 0 of 12
2. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 12
3. (calibrate satellite2 instrument4 groundstation2)
   added: (calibrated instrument4)
   goals met: 0 of 12
4. (turn_to satellite2 star10 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 star10)
   goals met: 0 of 12
5. (take_image satellite2 star10 instrument4 spectrograph2)
   added: (have_image star10 spectrograph2)
   goals met: 1 of 12
6. (turn_to satellite2 planet9 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 planet9)
   goals met: 1 of 12
7. (take_image satellite2 planet9 instrument4 thermograph1)
   added: (have_image planet9 thermograph1)
   goals met: 2 of 12
8. (turn_to satellite2 phenomenon5 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 phenomenon5)
   goals met: 2 of 12
9. (take_image satellite2 phenomenon5 instrument4 spectrograph2)
   added: (have_image phenomenon5 spectrograph2)
   goals met: 3 of 12
10. (turn_to satellite2 phenomenon15 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 phenomenon15)
   goals met: 3 of 12
11. (turn_to satellite1 star3 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 star3)
   goals met: 3 of 12
12. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 3 of 12
13. (calibrate satellite1 instrument3 star3)
   added: (calibrated instrument3)
   goals met: 3 of 12
14. (take_image satellite2 phenomenon15 instrument4 spectrograph2)
   added: (have_image phenomenon15 spectrograph2)
   goals met: 4 of 12
15. (turn_to satellite1 phenomenon14 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 phenomenon14)
   goals met: 4 of 12
16. (take_image satellite1 phenomenon14 instrument3 spectrograph0)
   added: (have_image phenomenon14 spectrograph0)
   goals met: 5 of 12
17. (turn_to satellite1 planet6 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 planet6)
   goals met: 5 of 12
18. (take_image satellite1 planet6 instrument3 spectrograph0)
   added: (have_image planet6 spectrograph0)
   goals met: 6 of 12
19. (turn_to satellite1 star13 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 star13)
   goals met: 6 of 12
20. (take_image satellite1 star13 instrument3 infrared3)
   added: (have_image star13 infrared3)
   goals met: 7 of 12
21. (turn_to satellite1 star7 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star7)
   goals met: 7 of 12
22. (take_image satellite1 star7 instrument3 infrared3)
   added: (have_image star7 infrared3)
   goals met: 8 of 12
23. (turn_to satellite1 star8 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star8)
   goals met: 8 of 12
24. (take_image satellite1 star8 instrument3 infrared3)
   added: (have_image star8 infrared3)
   goals met: 9 of 12
25. (turn_to satellite2 star11 phenomenon15)
   deleted: (pointing satellite2 phenomenon15)
   added: (pointing satellite2 star11)
   goals met: 9 of 12
26. (take_image satellite2 star11 instrument4 spectrograph2)
   added: (have_image star11 spectrograph2)
   goals met: 10 of 12
27. (turn_to satellite2 phenomenon12 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 phenomenon12)
   goals met: 11 of 12
28. (take_image satellite2 phenomenon12 instrument4 spectrograph2)
   added: (have_image phenomenon12 spectrograph2)
   goals met: 12 of 12
